; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph3 - mode
	spectrograph2 - mode
	spectrograph7 - mode
	thermograph1 - mode
	infrared6 - mode
	image0 - mode
	image4 - mode
	thermograph5 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	Star5 - direction
	Star0 - direction
	GroundStation3 - direction
	Star6 - direction
	Star1 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(supports instrument0 thermograph5)
	(supports instrument0 spectrograph7)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star6)
	(supports instrument1 image4)
	(supports instrument1 image0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star0)
	(supports instrument2 image4)
	(supports instrument2 infrared6)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument3 image4)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star6)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
)
(:goal (and
	(pointing satellite0 Star10)
	(pointing satellite1 Star11)
	(have_image Planet7 image0)
	(have_image Planet7 thermograph1)
	(have_image Phenomenon8 image4)
	(have_image Star9 spectrograph7)
	(have_image Star10 thermograph3)
	(have_image Star11 spectrograph7)
	(have_image Phenomenon12 image4)
	(have_image Phenomenon12 thermograph1)
	(have_image Planet13 thermograph5)
	(have_image Planet13 spectrograph2)
))

)

; plan
1. (turn_to satellite1 star1 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star1)
   goals met: 0 of 12
2. (turn_to satellite0 star0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star0)
   goals met: 0 of 12
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
4. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 12
5. (turn_to satellite0 planet13 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet13)
   goals met: 0 of 12
6. (take_image satellite0 planet13 instrument1 spectrograph2)
   added: (have_image planet13 spectrograph2)
   goals met: 1 of 12
7. (turn_to satellite0 star0 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star0)
   goals met: 1 of 12
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 12
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 12
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 12
11. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 1 of 12
12. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 1 of 12
13. (turn_to satellite0 phenomenon12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 12
14. (take_image satellite0 phenomenon12 instrument0 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 2 of 12
15. (turn_to satellite0 planet13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet13)
   goals met: 2 of 12
16. (take_image satellite0 planet13 instrument0 thermograph5)
   added: (have_image planet13 thermograph5)
   goals met: 3 of 12
17. (turn_to satellite0 planet7 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet7)
   goals met: 3 of 12
18. (take_image satellite0 planet7 instrument0 image0)
   added: (have_image planet7 image0)
   goals met: 4 of 12
19. (take_image satellite0 planet7 instrument0 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 5 of 12
20. (turn_to satellite0 star11 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star11)
   goals met: 5 of 12
21. (take_image satellite0 star11 instrument0 spectrograph7)
   added: (have_image star11 spectrograph7)
   goals met: 6 of 12
22. (turn_to satellite0 star9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star9)
   goals met: 6 of 12
23. (take_image satellite0 star9 instrument0 spectrograph7)
   added: (have_image star9 spectrograph7)
   goals met: 7 of 12
24. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 8 of 12
25. (turn_to satellite1 phenomenon12 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon12)
   goals met: 8 of 12
26. (take_image satellite1 phenomenon12 instrument3 image4)
   added: (have_image phenomenon12 image4)
   goals met: 9 of 12
27. (turn_to satellite1 phenomenon8 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon8)
   goals met: 9 of 12
28. (take_image satellite1 phenomenon8 instrument3 image4)
   added: (have_image phenomenon8 image4)
   goals met: 10 of 12
29. (turn_to satellite1 star10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star10)
   goals met: 10 of 12
30. (take_image satellite1 star10 instrument3 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 11 of 12
31. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 12 of 12
